Reports/СТО_ОтчетПоЦелевомуТрафику.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Report>
		<Properties>
			<Name>СТО_ОтчетПоЦелевомуТрафику</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыбранныйВариантОтчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

InformationRegisters/Звонки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<Name>Звонки</Name>
			<Comment>Реестр входящих и исходящих звонков</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Comment>Дата и время выполнения звонка</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Регион</Name>
					<Comment>Регион внешнего абонента</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Страны</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сервер</Name>
					<Comment>Сервер телефонии</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТелСерверы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Принят</Name>
					<Comment>Индикатор состоявшегося звонка</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инициатор</Name>
					<Comment>Инициатор звонка</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТелВнутренние</v8:Type>
						<v8:Type>cfg:CatalogRef.ТелВнешние</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлЗаписи</Name>
					<Comment>Имя файла с записью звонка</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоВходящий</Name>
					<Comment>Направление звонка</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АбонентВнешний</Name>
					<Comment>Телефон внешнего абонента</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АбонентВнутренний</Name>
					<Comment>Телефон внутреннего абонента завершившего звонок</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТелВнутренние</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВходаОчередь</Name>
					<Comment>Под каким порядковым номером звонок помещен в очередь</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВыходаОчередь</Name>
					<Comment>Под каким порядковым номером звонок был в очереди, когода абонент прервал вызов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сигнатура</Name>
					<Comment>Сигнатура звонка</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Reports/СТО_ОтчетПоЦелевомуТрафику/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)	
	//Убери вопрос "Вариант отчета был изменен, сохранить?"
	//----------------------------------------------------
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

#Область Расшифровка
&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	СтандартнаяОбработка = Ложь;
	рез = РезультатОбработкаРасшифровкиНаСервере(Расшифровка);

	Если СтрНайти(Рез, "#", , 2) >1 Тогда
		Парам = Новый Структура();
		Парам.Вставить("Сигнатура", рез);
		Если Лев(Рез,1) = "0" Тогда
			ИмяОткрываемойФормы = "РегистрСведений.Звонки.Форма.ФормаВходящегоЧтение";
		Иначе
			ИмяОткрываемойФормы = "РегистрСведений.Звонки.Форма.ФормаИсходящегоЧтение";
		КонецЕсли;
		ОткрытьФорму(ИмяОткрываемойФормы, Парам, ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
        Возврат;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция РезультатОбработкаРасшифровкиНаСервере(Расшифровка)
	
	РасшифровкаОтчета = ПолучитьИзВременногоХранилища(ЭтаФорма.ДанныеРасшифровки);
	ЭлементыРасшифровки = РасшифровкаОтчета.Элементы;
	РасшифровкаЯчейки =  ЭлементыРасшифровки.Получить(Расшифровка);
	ЗначенияПолейРасш = РасшифровкаЯчейки.ПолучитьПоля();
	ЗначениеПоляРасш = ЗначенияПолейРасш.Получить(0);
	Возврат ЗначениеПоляРасш.Значение;

КонецФункции
#КонецОбласти

#Область Выбор_периода
&НаКлиенте
Процедура ВыборПериода(Команда)
	Диалог = Новый ДиалогРедактированияСтандартногоПериода(); 
	Диалог.Период = Отчет.Период;    
	
	ПриЗакрытииДиалогаВыбораПериода = Новый ОписаниеОповещения("ПриЗакрытииДиалогаВыбораПериода", ЭтаФорма);
	Диалог.Показать(ПриЗакрытииДиалогаВыбораПериода);
КонецПроцедуры

Процедура ПриЗакрытииДиалогаВыбораПериода(Парам1, Парам2) Экспорт
	// Парам1 - период
	// Парам2 - доп. парам
	
	Если ТипЗнч(Парам1) <> Тип("СтандартныйПериод") Тогда
		Возврат;
	КонецЕсли;
	Элементы.ВыборПериода.Заголовок = " "+Формат(Парам1.ДатаНачала, "ДЛФ=Д")+" - "+Формат(Парам1.ДатаОкончания, "ДЛФ=Д");
	Отчет.Период = Парам1;
КонецПроцедуры

#КонецОбласти
